# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0s head
head:
  - [-1, 1, SimConv, [256, 1, 1]]
  - [-1, 1, Transpose, [256]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 12, RepBlock, [256]]

  - [-1, 1, SimConv, [128, 1, 1]]
  - [-1, 1, Transpose, [128]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 12, RepBlock, [128]]   #out

  - [-1, 1, SimConv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 12, RepBlock, [256]]  # 20 (P4/16-medium)

  - [-1, 1, SimConv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 12, RepBlock, [512]]

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
