# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2   3*640*640 64*320*320
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4   64*320*320 128*160*160
  - [-1, 3, C2f_DCN2, [128, True]]      # 2        128*160*160
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8   128*160*160 256*80*80
  - [-1, 6, C2f_DCN2, [256, True]]      # 4        256*80*80
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16  256*80*80 512*40*40
  - [-1, 6, C2f_DCN2, [512, True]]      # 6        512*40*40
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32  512*40*40 1024*20*20
  - [-1, 3, C2f_DCN2, [1024, True]]     # 8        1024*20*20
  - [-1, 1, SPPF, [1024, 5]]            # 9        1024*20*20

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10-p4/16  1024*20*20 1024*40*40
  - [[-1, 6], 1, Concat, [1]]                    # 11        (1024+512)*40*40
  - [-1, 3, C2f, [512]]                          # 12        1536*40*40 512*40*40

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13-P3/8   512*40*40 512*80*80
  - [[-1, 4], 1, Concat, [1]]                    # 14        (512+256)*80*80
  - [-1, 3, C2f, [256]]                          # 15        768*80*80 256*80*80

  - [-1, 1, Conv, [256, 3, 2]]                   # 16-P4/16  256*80*80 256*40*40
  - [[-1, 12], 1, Concat, [1]]                   # 17        (256+512)*40*40
  - [-1, 3, C2f, [512]]                          # 18        768*40*40 512*40*40

  - [-1, 1, Conv, [512, 3, 2]]                   # 19-P5/32  512*40*40 512*20*20
  - [[-1, 9], 1, Concat, [1]]                    # 20        (512+1024)*20*20
  - [-1, 3, C2f, [1024]]                         # 21        1536*20*20 1024*20*20

  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)
